Tekla Open API Reference for Tekla Structures 2025
TeklaProgressBar.Text Property
Gets or sets the current message text of the progress bar.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Text { get; set; }
Public Property Text As String
	Get
	Set
Property Value
Type: String
See Also
Reference
TeklaProgressBar Class
Tekla.Structures.Dialog Namespace